Show / Hide Table of Contents
Class RebarSegment3DArc3Pts
Represents an arc segment in 3D space defined by 3 points Start, End and a Point between start and end point.
Inheritance
System.Object
OpenObject
RebarSegment3DBase
RebarSegment3DArc3Pts
Inherited Members
 RebarSegment3DBase.EndPoint
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
public class RebarSegment3DArc3Pts : RebarSegment3DBase
Properties
Improve this Doc   View Source
ThirdPoint
Gets or sets the point of circular arc somewhere between start and end point.
Declaration
public Point3D ThirdPoint { get; set; }
Property Value
 Type |  Description
 Point3D
 Improve this Doc
 View Source